abandon,放棄,verb
ability,能力,noun
able,能夠的,adjective
aboard,在船(飛機、車)上,preposition
about,關於,preposition
above,在...之上,preposition
abroad,在國外,adverb
absence,缺席,noun
absolute,絕對的,adjective
absolutely,絕對地,adverb
absorb,吸收,verb
abstract,抽象的,adjective
academic,學術的,adjective
accelerate,加速,verb
accent,口音,noun
accept,接受,verb
acceptable,可接受的,adjective
access,進入,noun
accessibility,可接近性,noun
accessible,易接近的,adjective
accident,事故,noun
accidental,偶然的,adjective
accidentally,意外地,adverb
accommodate,容納,verb
accommodation,住宿,noun
accompany,陪伴,verb
accomplish,完成,verb
accomplishment,成就,noun
according to,根據,preposition
account,帳戶,noun
accountant,會計師,noun
accounting,會計,noun
accumulate,積累,verb
accuracy,準確性,noun
accurate,準確的,adjective
accusation,指控,noun
accuse,指責,verb
achieve,達成,verb
achievement,成就,noun
acknowledge,承認,verb
acquire,獲得,verb
acquisition,獲得,noun
across,穿過,preposition
act,行動,verb
action,行動,noun
activate,啟動,verb
active,活躍的,adjective
activity,活動,noun
actor,演員,noun
actress,女演員,noun
actual,實際的,adjective
actually,實際上,adverb
adapt,適應,verb
adaptable,適應性強的,adjective
adaptation,改編,noun
add,添加,verb
addition,加法,noun
additional,額外的,adjective
address,地址,noun
adequate,足夠的,adjective
adjust,調整,verb
adjustment,調整,noun
administer,管理,verb
administration,行政,noun
administrative,行政的,adjective
administrator,管理員,noun
admire,欽佩,verb
admission,入場,noun
admit,承認,verb
adolescent,青少年,noun
adopt,採用,verb
adoption,採用,noun
adult,成人,noun
advance,前進,verb
advanced,高級的,adjective
advantage,優勢,noun
adventure,冒險,noun
advertise,做廣告,verb
advertisement,廣告,noun
advertising,廣告業,noun
advice,建議,noun
advise,建議,verb
advocate,提倡,verb
affect,影響,verb
affiliate,附屬機構,noun
afford,負擔得起,verb
afraid,害怕的,adjective
after,之後,preposition
afternoon,下午,noun
again,再次,adverb
against,反對,preposition
age,年齡,noun
agency,機構,noun
agenda,議程,noun
agent,代理人,noun
aggressive,侵略性的,adjective
ago,...之前,adverb
agree,同意,verb
agreement,協議,noun
agriculture,農業,noun
ahead,在前面,adverb
aid,援助,noun
aim,目標,noun
air,空氣,noun
aircraft,飛機,noun
airline,航空公司,noun
airplane,飛機,noun
airport,機場,noun
aisle,走道,noun
alarm,警報,noun
alcohol,酒精,noun
alert,警覺的,adjective
alike,相似的,adjective
alive,活著的,adjective
all,全部,pronoun
allergy,過敏,noun
alliance,聯盟,noun
allocate,分配,verb
allow,允許,verb
allowance,津貼,noun
almost,幾乎,adverb
alone,獨自,adjective
along,沿著,preposition
alongside,在...旁邊,preposition
already,已經,adverb
also,也,adverb
alter,改變,verb
alternate,交替的,adjective
alternative,替代方案,noun
although,雖然,conjunction
altogether,完全地,adverb
always,總是,adverb
amazing,令人驚嘆的,adjective
ambassador,大使,noun
ambition,抱負,noun
ambitious,有野心的,adjective
ambulance,救護車,noun
amend,修改,verb
amendment,修正案,noun
among,在...之中,preposition
amount,數量,noun
ample,充足的,adjective
amuse,娛樂,verb
amusement,娛樂,noun
analyze,分析,verb
analysis,分析,noun
analyst,分析師,noun
ancestor,祖先,noun
anchor,錨,noun
ancient,古老的,adjective
and,和,conjunction
anger,憤怒,noun
angle,角度,noun
angry,生氣的,adjective
animal,動物,noun
animation,動畫,noun
anniversary,週年紀念,noun
announce,宣布,verb
announcement,公告,noun
annoy,煩擾,verb
annual,年度的,adjective
annually,每年,adverb
anonymous,匿名的,adjective
another,另一個,determiner
answer,回答,verb
anticipate,預期,verb
anxiety,焦慮,noun
anxious,焦慮的,adjective
any,任何,determiner
anybody,任何人,pronoun
anyhow,無論如何,adverb
anyone,任何人,pronoun
anything,任何事物,pronoun
anyway,無論如何,adverb
anywhere,任何地方,adverb
apart,分開,adverb
apartment,公寓,noun
apologize,道歉,verb
apology,道歉,noun
apparatus,裝置,noun
apparent,明顯的,adjective
appeal,呼籲,noun
appear,出現,verb
appearance,外表,noun
appendix,附錄,noun
appetite,胃口,noun
appliance,電器,noun
applicable,適用的,adjective
applicant,申請人,noun
application,應用,noun
apply,申請,verb
appoint,任命,verb
appointment,約會,noun
appreciate,感謝,verb
appreciation,感謝,noun
approach,方法,noun
appropriate,適當的,adjective
approval,批准,noun
approve,批准,verb
approximate,大約的,adjective
approximately,大約,adverb
architect,建築師,noun
architecture,建築,noun
area,區域,noun
argue,爭論,verb
argument,爭論,noun
arise,出現,verb
arithmetic,算術,noun
arm,手臂,noun
armchair,扶手椅,noun
army,軍隊,noun
around,周圍,preposition
arrange,安排,verb
arrangement,安排,noun
array,排列,noun
arrest,逮捕,verb
arrival,到達,noun
arrive,到達,verb
arrow,箭,noun
art,藝術,noun
article,文章,noun
artificial,人造的,adjective
artist,藝術家,noun
artistic,藝術的,adjective
as,如同,preposition
ash,灰燼,noun
ashamed,慚愧的,adjective
aside,在旁邊,adverb
ask,詢問,verb
asleep,睡著的,adjective
aspect,方面,noun
assemble,組裝,verb
assembly,集會,noun
assess,評估,verb
assessment,評估,noun
asset,資產,noun
assign,分配,verb
assignment,任務,noun
assist,協助,verb
assistance,幫助,noun
assistant,助手,noun
associate,關聯,verb
association,協會,noun
assume,假設,verb
assumption,假設,noun
assurance,保證,noun
assure,保證,verb
astonish,使驚訝,verb
athlete,運動員,noun
athletic,運動的,adjective
atmosphere,氣氛,noun
attach,附加,verb
attachment,附件,noun
attack,攻擊,verb
attain,達到,verb
attempt,嘗試,verb
attend,參加,verb
attendance,出席,noun
attention,注意力,noun
attitude,態度,noun
attorney,律師,noun
attract,吸引,verb
attraction,吸引力,noun
attractive,有吸引力的,adjective
attribute,歸因於,verb
audience,觀眾,noun
audio,音頻,noun
audit,審計,noun
auditor,審計師,noun
august,八月,noun
authentic,真實的,adjective
author,作者,noun
authority,權威,noun
authorize,授權,verb
automatic,自動的,adjective
automobile,汽車,noun
autonomous,自主的,adjective
autumn,秋天,noun
available,可用的,adjective
avenue,大道,noun
average,平均,noun
avoid,避免,verb
await,等待,verb
awake,醒著的,adjective
award,獎勵,noun
aware,意識到的,adjective
awareness,意識,noun
away,遠離,adverb
awful,可怕的,adjective
baby,嬰兒,noun
back,背部,noun
background,背景,noun
backward,向後的,adjective
bacteria,細菌,noun
bad,壞的,adjective
badge,徽章,noun
bag,袋子,noun
baggage,行李,noun
bake,烘焙,verb
balance,平衡,noun
balcony,陽台,noun
ball,球,noun
ballet,芭蕾舞,noun
balloon,氣球,noun
ballot,選票,noun
ban,禁止,verb
banana,香蕉,noun
band,樂隊,noun
bandwidth,帶寬,noun
bank,銀行,noun
banker,銀行家,noun
banking,銀行業務,noun
bankrupt,破產的,adjective
banner,橫幅,noun
bar,酒吧,noun
barbecue,烤肉,noun
barber,理髮師,noun
bargain,討價還價,noun
barrier,障礙,noun
base,基地,noun
baseball,棒球,noun
basement,地下室,noun
basic,基本的,adjective
basically,基本上,adverb
basis,基礎,noun
basket,籃子,noun
basketball,籃球,noun
bathroom,浴室,noun
battery,電池,noun
battle,戰鬥,noun
bay,海灣,noun
beach,海灘,noun
beam,光束,noun
bean,豆子,noun
bear,熊,noun
beard,鬍子,noun
bearing,軸承,noun
beast,野獸,noun
beat,打敗,verb
beautiful,美麗的,adjective
beauty,美麗,noun
because,因為,conjunction
become,變成,verb
bed,床,noun
bedroom,臥室,noun
beef,牛肉,noun
beer,啤酒,noun
before,在...之前,preposition
beg,乞求,verb
begin,開始,verb
beginner,初學者,noun
beginning,開始,noun
behalf,代表,noun
behave,表現,verb
behavior,行為,noun
behind,在...後面,preposition
being,存在,noun
belief,信念,noun
believe,相信,verb
bell,鈴,noun
belong,屬於,verb
below,在...下面,preposition
belt,腰帶,noun
bench,長凳,noun
bend,彎曲,verb
beneath,在...下面,preposition
beneficial,有益的,adjective
benefit,益處,noun
besides,除了...之外,preposition
best,最好的,adjective
bet,打賭,verb
better,更好的,adjective
between,在...之間,preposition
beverage,飲料,noun
beyond,超越,preposition
bias,偏見,noun
bicycle,自行車,noun
bid,出價,noun
big,大的,adjective
bike,自行車,noun
bill,帳單,noun
billion,十億,number
bin,箱子,noun
bind,綁定,verb
biography,傳記,noun
biology,生物學,noun
bird,鳥,noun
birth,出生,noun
birthday,生日,noun
biscuit,餅乾,noun
bit,一點點,noun
bite,咬,verb
bitter,苦的,adjective
black,黑色的,adjective
blade,刀片,noun
blame,責備,verb
blank,空白的,adjective
blanket,毯子,noun
blast,爆炸,noun
bleed,流血,verb
blend,混合,verb
bless,祝福,verb
blind,盲的,adjective
blink,眨眼,verb
block,阻擋,verb
blog,部落格,noun
blood,血液,noun
bloom,開花,verb
blossom,花開,verb
blouse,女式襯衫,noun
blow,吹,verb
blue,藍色的,adjective
board,板,noun
boat,船,noun
body,身體,noun
boil,煮沸,verb
bold,大膽的,adjective
bomb,炸彈,noun
bond,債券,noun
bone,骨頭,noun
bonus,獎金,noun
book,書,noun
booking,預訂,noun
boom,繁榮,noun
boost,提升,verb
boot,靴子,noun
booth,展位,noun
border,邊界,noun
bore,使厭煩,verb
born,出生的,adjective
borrow,借,verb
boss,老闆,noun
both,兩者,determiner
bother,打擾,verb
bottle,瓶子,noun
bottom,底部,noun
boundary,邊界,noun
bowl,碗,noun
box,盒子,noun
boy,男孩,noun
brain,大腦,noun
brake,剎車,noun
branch,分支,noun
brand,品牌,noun
brave,勇敢的,adjective
bread,麵包,noun
break,打破,verb
breakfast,早餐,noun
breast,胸部,noun
breath,呼吸,noun
breathe,呼吸,verb
breed,品種,noun
breeze,微風,noun
brick,磚,noun
bridge,橋,noun
brief,簡短的,adjective
briefcase,公事包,noun
bright,明亮的,adjective
brilliant,輝煌的,adjective
bring,帶來,verb
broad,寬廣的,adjective
broadcast,廣播,verb
brochure,小冊子,noun
broken,破碎的,adjective
broker,經紀人,noun
bronze,青銅,noun
brother,兄弟,noun
brown,棕色的,adjective
browser,瀏覽器,noun
brush,刷子,noun
bubble,泡泡,noun
bucket,桶,noun
budget,預算,noun
buffer,緩衝,noun
bug,蟲子,noun
build,建造,verb
builder,建造者,noun
building,建築物,noun
bulb,燈泡,noun
bulk,大量,noun
bullet,子彈,noun
bulletin,公告,noun
bunch,一束,noun
bundle,捆綁,noun
burden,負擔,noun
bureau,局,noun
burial,埋葬,noun
burn,燃燒,verb
burst,爆裂,verb
bury,埋葬,verb
bus,公車,noun
bush,灌木叢,noun
business,業務,noun
businessman,商人,noun
busy,忙碌的,adjective
but,但是,conjunction
butter,奶油,noun
button,按鈕,noun
buy,購買,verb
buyer,購買者,noun
by,通過,preposition
cab,計程車,noun
cabin,小屋,noun
cabinet,櫥櫃,noun
cable,電纜,noun
cafe,咖啡館,noun
cage,籠子,noun
cake,蛋糕,noun
calculate,計算,verb
calculator,計算器,noun
calendar,日曆,noun
call,呼叫,verb
calm,平靜的,adjective
camera,相機,noun
camp,營地,noun
campaign,活動,noun
campus,校園,noun
can,能夠,modal verb
cancel,取消,verb
cancer,癌症,noun
candidate,候選人,noun
candle,蠟燭,noun
candy,糖果,noun
canvas,畫布,noun
cap,帽子,noun
capability,能力,noun
capable,有能力的,adjective
capacity,容量,noun
capital,資本,noun
captain,船長,noun
caption,標題,noun
car,汽車,noun
carbohydrate,碳水化合物,noun
carbon,碳,noun
card,卡片,noun
care,關心,verb
career,職業,noun
careful,小心的,adjective
careless,粗心的,adjective
cargo,貨物,noun
carpet,地毯,noun
carriage,馬車,noun
carrier,運營商,noun
carrot,胡蘿蔔,noun
carry,攜帶,verb
cart,車,noun
cartoon,卡通,noun
carve,雕刻,verb
case,情況,noun
cash,現金,noun
cashier,收銀員,noun
cast,投擲,verb
castle,城堡,noun
casual,休閒的,adjective
cat,貓,noun
catalog,目錄,noun
catch,抓住,verb
category,類別,noun
cater,提供餐飲服務,verb
cathedral,大教堂,noun
cattle,牛,noun
cause,原因,noun
caution,小心,noun
cautious,謹慎的,adjective
cave,洞穴,noun
cease,停止,verb
ceiling,天花板,noun
celebrate,慶祝,verb
celebration,慶祝活動,noun
celebrity,名人,noun
cell,細胞,noun
cemetery,公墓,noun
cent,分,noun
center,中心,noun
central,中央的,adjective
century,世紀,noun
ceremony,儀式,noun
certain,某些,adjective
certainly,當然,adverb
certificate,證書,noun
chain,鏈條,noun
chair,椅子,noun
chairman,主席,noun
challenge,挑戰,noun
chamber,房間,noun
champion,冠軍,noun
championship,錦標賽,noun
chance,機會,noun
change,改變,verb
channel,頻道,noun
chaos,混亂,noun
chapter,章節,noun
character,性格,noun
characteristic,特徵,noun
charge,收費,verb
charity,慈善,noun
charm,魅力,noun
chart,圖表,noun
charter,憲章,noun
chase,追逐,verb
chat,聊天,verb
cheap,便宜的,adjective
cheat,欺騙,verb
check,檢查,verb
cheek,臉頰,noun
cheer,歡呼,verb
cheerful,愉快的,adjective
cheese,奶酪,noun
chef,廚師,noun
chemical,化學的,adjective
chemistry,化學,noun
cheque,支票,noun
cherry,櫻桃,noun
chest,胸部,noun
chicken,雞肉,noun
chief,首領,noun
child,孩子,noun
childhood,童年,noun
chill,寒冷,noun
chimney,煙囪,noun
chin,下巴,noun
chip,芯片,noun
chocolate,巧克力,noun
choice,選擇,noun
choose,選擇,verb
church,教堂,noun
cigarette,香煙,noun
cinema,電影院,noun
circle,圓圈,noun
circuit,電路,noun
circular,圓形的,adjective
circulate,流通,verb
circumstance,情況,noun
citizen,公民,noun
citizenship,公民身份,noun
city,城市,noun
civil,民事的,adjective
civilian,平民,noun
civilization,文明,noun
claim,宣稱,verb
clap,拍手,verb
clarify,澄清,verb
clarity,清晰度,noun
class,班級,noun
classic,經典的,adjective
classical,古典的,adjective
classification,分類,noun
classify,分類,verb
classroom,教室,noun
clause,條款,noun
clay,黏土,noun
clean,清潔的,adjective
clear,清晰的,adjective
clearly,清晰地,adverb
clerk,職員,noun
clever,聰明的,adjective
click,點擊,verb
client,客戶,noun
cliff,懸崖,noun
climate,氣候,noun
climb,攀爬,verb
clinic,診所,noun
clinical,臨床的,adjective
clip,夾子,noun
clock,時鐘,noun
close,關閉,verb
cloth,布,noun
clothes,衣服,noun
clothing,服裝,noun
cloud,雲,noun
cloudy,多雲的,adjective
club,俱樂部,noun
clue,線索,noun
cluster,集群,noun
coach,教練,noun
coal,煤,noun
coast,海岸,noun
coat,外套,noun
code,代碼,noun
coffee,咖啡,noun
cognitive,認知的,adjective
coin,硬幣,noun
cold,冷的,adjective
collaborate,合作,verb
collaboration,合作,noun
collapse,崩潰,verb
collar,衣領,noun
colleague,同事,noun
collect,收集,verb
collection,收藏,noun
collective,集體的,adjective
collector,收藏家,noun
college,學院,noun
collision,碰撞,noun
colonel,上校,noun
colonial,殖民的,adjective
colony,殖民地,noun
color,顏色,noun
column,列,noun
combination,組合,noun
combine,結合,verb
come,來,verb
comedy,喜劇,noun
comfort,舒適,noun
comfortable,舒適的,adjective
comic,漫畫,noun
command,命令,verb
commander,指揮官,noun
commemorate,紀念,verb
commence,開始,verb
comment,評論,noun
commerce,商業,noun
commercial,商業的,adjective
commission,委員會,noun
commit,承諾,verb
commitment,承諾,noun
committee,委員會,noun
commodity,商品,noun
common,常見的,adjective
commonly,通常地,adverb
communicate,溝通,verb
communication,交流,noun
community,社區,noun
company,公司,noun
comparable,可比較的,adjective
comparative,比較的,adjective
compare,比較,verb
comparison,比較,noun
compassion,同情,noun
compatible,兼容的,adjective
compel,迫使,verb
compensate,補償,verb
compensation,補償,noun
compete,競爭,verb
competence,能力,noun
competent,有能力的,adjective
competition,競爭,noun
competitive,有競爭力的,adjective
competitor,競爭對手,noun
compile,編譯,verb
complain,抱怨,verb
complaint,投訴,noun
complete,完成,verb
completely,完全地,adverb
complex,複雜的,adjective
complexity,複雜性,noun
compliance,遵守,noun
complicate,使複雜化,verb
complicated,複雜的,adjective
complication,併發症,noun
compliment,讚美,noun
comply,遵守,verb
component,組件,noun
compose,組成,verb
composer,作曲家,noun
composition,作文,noun
compound,化合物,noun
comprehensive,全面的,adjective
comprise,包含,verb
compromise,妥協,noun
compulsory,強制的,adjective
compute,計算,verb
computer,電腦,noun
conceal,隱藏,verb
conceive,構思,verb
concentrate,集中,verb
concentration,集中,noun
concept,概念,noun
conception,概念,noun
concern,關注,verb
concerning,關於,preposition
concert,音樂會,noun
concession,讓步,noun
conclude,結束,verb
conclusion,結論,noun
concrete,混凝土,noun
condemn,譴責,verb
condition,條件,noun
conduct,行為,noun
conference,會議,noun
confess,承認,verb
confession,自白,noun
confidence,自信,noun
confident,自信的,adjective
confidential,機密的,adjective
configuration,配置,noun
confine,限制,verb
confirm,確認,verb
confirmation,確認,noun
conflict,衝突,noun
conform,符合,verb
confront,面對,verb
confusion,混亂,noun
congratulate,祝賀,verb
congratulation,祝賀,noun
congress,國會,noun
conjunction,連接詞,noun
connect,連接,verb
connection,連接,noun
conscience,良心,noun
conscious,有意識的,adjective
consciousness,意識,noun
consecutive,連續的,adjective
consensus,共識,noun
consent,同意,verb
consequence,後果,noun
consequently,因此,adverb
conservation,保護,noun
conservative,保守的,adjective
consider,考慮,verb
considerable,相當的,adjective
consideration,考慮,noun
consist,包括,verb
consistent,一致的,adjective
consistently,一貫地,adverb
console,安慰,verb
consolidate,鞏固,verb
consortium,聯合體,noun
conspiracy,陰謀,noun
constant,恆定的,adjective
constantly,不斷地,adverb
constituent,選民,noun
constitute,構成,verb
constitution,憲法,noun
constitutional,憲法的,adjective
constraint,約束,noun
construct,建造,verb
construction,建設,noun
consult,諮詢,verb
consultant,顧問,noun
consultation,諮詢,noun
consume,消費,verb
consumer,消費者,noun
consumption,消費,noun
contact,聯繫,noun
contain,包含,verb
container,容器,noun
contemporary,當代的,adjective
content,內容,noun
contest,比賽,noun
context,上下文,noun
continent,大陸,noun
continue,繼續,verb
continuous,連續的,adjective
contract,合同,noun
contractor,承包商,noun
contradict,反駁,verb
contradiction,矛盾,noun
contrary,相反的,adjective
contrast,對比,noun
contribute,貢獻,verb
contribution,貢獻,noun
contributor,貢獻者,noun
control,控制,verb
controversial,有爭議的,adjective
controversy,爭議,noun
convenience,便利,noun
convenient,方便的,adjective
convention,公約,noun
conventional,傳統的,adjective
conversation,談話,noun
conversion,轉換,noun
convert,轉換,verb
convey,傳達,verb
convict,罪犯,noun
conviction,定罪,noun
convince,說服,verb
convincing,令人信服的,adjective
cook,烹飪,verb
cookie,餅乾,noun
cooking,烹飪,noun
cool,涼爽的,adjective
cooperate,合作,verb
cooperation,合作,noun
cooperative,合作的,adjective
coordinate,協調,verb
coordination,協調,noun
coordinator,協調員,noun
cope,應對,verb
copy,複製,verb
copyright,版權,noun
cord,繩索,noun
core,核心,noun
corner,角落,noun
corporate,企業的,adjective
corporation,公司,noun
correct,正確的,adjective
correction,更正,noun
correctly,正確地,adverb
correlate,相關,verb
correlation,相關性,noun
correspond,對應,verb
correspondence,通信,noun
correspondent,通訊員,noun
corresponding,相應的,adjective
corridor,走廊,noun
corrupt,腐敗的,adjective
corruption,腐敗,noun
cost,成本,noun
costly,昂貴的,adjective
costume,服裝,noun
cottage,小屋,noun
cotton,棉花,noun
couch,沙發,noun
cough,咳嗽,verb
could,能夠,modal verb
council,理事會,noun
counsel,建議,noun
counselor,顧問,noun
count,計數,verb
counter,櫃檯,noun
counterpart,對應物,noun
country,國家,noun
countryside,鄉村,noun
county,縣,noun
couple,夫妻,noun
courage,勇氣,noun
course,課程,noun
court,法院,noun
courtyard,庭院,noun
cousin,表兄弟姐妹,noun
cover,覆蓋,verb
coverage,覆蓋範圍,noun
cow,奶牛,noun
crack,裂縫,noun
craft,工藝,noun
crash,碰撞,noun
crawl,爬行,verb
crazy,瘋狂的,adjective
cream,奶油,noun
create,創建,verb
creation,創作,noun
creative,創意的,adjective
creativity,創造力,noun
creature,生物,noun
credibility,可信度,noun
credit,信用,noun
creditor,債權人,noun
crew,船員,noun
crime,犯罪,noun
criminal,犯罪的,adjective
crisis,危機,noun
criterion,標準,noun
critic,評論家,noun
critical,批判的,adjective
criticism,批評,noun
criticize,批評,verb
crop,農作物,noun
cross,交叉,verb
crowd,人群,noun
crucial,關鍵的,adjective
crude,原油,noun
cruel,殘忍的,adjective
cruise,巡航,noun
crush,壓碎,verb
cry,哭泣,verb
crystal,水晶,noun
cube,立方體,noun
cucumber,黃瓜,noun
cue,提示,noun
cultivate,培養,verb
cultural,文化的,adjective
culture,文化,noun
cup,杯子,noun
cupboard,櫥櫃,noun
cure,治愈,verb
curiosity,好奇心,noun
curious,好奇的,adjective
currency,貨幣,noun
current,當前的,adjective
current,當前的,adjective
curriculum,課程,noun
curtain,窗簾,noun
curve,曲線,noun
cushion,墊子,noun
custody,監護權,noun
custom,習俗,noun
customer,顧客,noun
customs,海關,noun
cut,切,verb
cute,可愛的,adjective
cycle,循環,noun
cylinder,圓柱體,noun
dad,爸爸,noun
daily,每日的,adjective
dairy,乳製品,noun
dam,水壩,noun
damage,損壞,noun
damp,潮濕的,adjective
dance,跳舞,verb
danger,危險,noun
dangerous,危險的,adjective
dare,敢,verb
dark,黑暗的,adjective
darkness,黑暗,noun
data,數據,noun
database,數據庫,noun
date,日期,noun
daughter,女兒,noun
dawn,黎明,noun
day,日,noun
dead,死的,adjective
deadline,截止日期,noun
deadly,致命的,adjective
deaf,聾的,adjective
deal,交易,verb
dealer,交易商,noun
dear,親愛的,adjective
death,死亡,noun
debate,辯論,noun
debris,碎片,noun
debt,債務,noun
debug,調試,verb
decade,十年,noun
decay,腐爛,verb
deceive,欺騙,verb
December,十二月,noun
decent,體面的,adjective
decide,決定,verb
decision,決定,noun
decisive,果斷的,adjective
deck,甲板,noun
declaration,宣言,noun
declare,宣布,verb
decline,下降,verb
decorate,裝飾,verb
decoration,裝飾,noun
decrease,減少,verb
dedicate,奉獻,verb
deduct,扣除,verb
deed,行為,noun
deep,深的,adjective
default,違約,noun
defeat,打敗,verb
defect,缺陷,noun
defence,防禦,noun
defend,防守,verb
defendant,被告,noun
defense,防禦,noun
defensive,防禦性的,adjective
deficiency,缺乏,noun
deficit,赤字,noun
define,定義,verb
definite,確定的,adjective
definitely,明確地,adverb
definition,定義,noun
degree,學位,noun
delay,延遲,verb
delegate,代表,noun
delegation,代表團,noun
delete,刪除,verb
deliberate,故意的,adjective
delicate,精緻的,adjective
delicious,美味的,adjective
delight,高興,verb
deliver,交付,verb
delivery,交付,noun
demand,需求,noun
democracy,民主,noun
democratic,民主的,adjective
demolish,拆除,verb
demonstrate,示範,verb
demonstration,示範,noun
denial,否認,noun
denim,牛仔布,noun
denounce,譴責,verb
dense,密集的,adjective
density,密度,noun
dental,牙科的,adjective
dentist,牙醫,noun
deny,否認,verb
depart,離開,verb
department,部門,noun
departure,離開,noun
depend,依賴,verb
dependent,依賴的,adjective
depict,描繪,verb
deploy,部署,verb
deposit,存款,noun
depot,倉庫,noun
depress,使沮喪,verb
depression,抑鬱症,noun
depth,深度,noun
deputy,副手,noun
derive,衍生,verb
descend,下降,verb
describe,描述,verb
description,描述,noun
desert,沙漠,noun
deserve,值得,verb
design,設計,verb
designate,指定,verb
designer,設計師,noun
desire,慾望,noun
desk,書桌,noun
desktop,桌面,noun
despair,絕望,noun
desperate,絕望的,adjective
despite,儘管,preposition
dessert,甜點,noun
destination,目的地,noun
destroy,摧毀,verb
destruction,破壞,noun
detail,細節,noun
detailed,詳細的,adjective
detect,檢測,verb
detective,偵探,noun
determination,決心,noun
determine,確定,verb
devastate,摧毀,verb
develop,發展,verb
developer,開發者,noun
development,發展,noun
device,設備,noun
devil,魔鬼,noun
devote,奉獻,verb
dew,露水,noun
diagnose,診斷,verb
diagnosis,診斷,noun
diagram,圖表,noun
dial,撥號,verb
dialog,對話,noun
dialogue,對話,noun
diameter,直徑,noun
diamond,鑽石,noun
diary,日記,noun
dictate,聽寫,verb
dictionary,字典,noun
die,死,verb
diet,飲食,noun
differ,不同,verb
difference,差異,noun
different,不同的,adjective
difficult,困難的,adjective
difficulty,困難,noun
dig,挖掘,verb
digest,消化,verb
digital,數字的,adjective
dignity,尊嚴,noun
dilemma,困境,noun
dimension,維度,noun
diminish,減少,verb
dine,用餐,verb
dinner,晚餐,noun
dioxide,二氧化物,noun
diploma,文憑,noun
diplomat,外交官,noun
diplomatic,外交的,adjective
direct,直接的,adjective
direction,方向,noun
directly,直接地,adverb
director,導演,noun
directory,目錄,noun
dirt,污垢,noun
dirty,髒的,adjective
disability,殘疾,noun
disabled,殘疾的,adjective
disadvantage,劣勢,noun
disagree,不同意,verb
disagreement,分歧,noun
disappear,消失,verb
disappoint,使失望,verb
disappointment,失望,noun
disaster,災難,noun
disc,光碟,noun
discipline,紀律,noun
disclose,披露,verb
discount,折扣,noun
discourage,勸阻,verb
discourse,論述,noun
discover,發現,verb
discovery,發現,noun
discretion,酌情權,noun
discrimination,歧視,noun
discuss,討論,verb
discussion,討論,noun
disease,疾病,noun
disguise,偽裝,verb
disgust,厭惡,verb
dish,盤子,noun
dishonest,不誠實的,adjective
disk,磁盤,noun
dislike,不喜歡,verb
dismiss,解雇,verb
disorder,混亂,noun
display,顯示,verb
disposal,處置,noun
dispose,處置,verb
dispute,爭議,noun
disrupt,打斷,verb
disruption,中斷,noun
distance,距離,noun
distant,遙遠的,adjective
distinct,明顯的,adjective
distinction,區別,noun
distinctive,獨特的,adjective
distinguish,區分,verb
distort,扭曲,verb
distract,分心,verb
distribute,分發,verb
distribution,分配,noun
distributor,分銷商,noun
district,地區,noun
disturb,打擾,verb
ditch,溝渠,noun
dive,潛水,verb
diverse,多樣的,adjective
diversity,多樣性,noun
divide,分割,verb
divine,神聖的,adjective
division,部門,noun
divorce,離婚,verb
dizzy,頭暈的,adjective
do,做,verb
dock,碼頭,noun
doctor,醫生,noun
document,文件,noun
documentary,紀錄片,noun
documentation,文檔,noun
dog,狗,noun
doll,洋娃娃,noun
dollar,美元,noun
dolphin,海豚,noun
domain,域,noun
domestic,國內的,adjective
dominant,主導的,adjective
dominate,主宰,verb
donation,捐贈,noun
done,完成了的,verb
donor,捐贈者,noun
door,門,noun
doorway,門口,noun
dose,劑量,noun
dot,點,noun
double,雙倍的,adjective
doubt,懷疑,verb
dove,鴿子,noun
down,向下,adverb
download,下載,verb
downtown,市中心,noun
dozen,一打,noun
draft,草稿,noun
drag,拖,verb
dragon,龍,noun
drain,排水,verb
drama,戲劇,noun
dramatic,戲劇性的,adjective
draw,畫,verb
drawer,抽屜,noun
drawing,繪畫,noun
dream,夢想,verb
dress,衣服,noun
drift,漂流,verb
drill,鑽孔,verb
drink,飲料,noun
drip,滴落,verb
drive,開車,verb
driver,司機,noun
drizzle,毛毛雨,noun
drop,滴,verb
drought,乾旱,noun
drown,淹死,verb
drug,藥物,noun
drum,鼓,noun
drunk,醉的,adjective
dry,乾的,adjective
dual,雙重的,adjective
duck,鴨子,noun
due,到期的,adjective
dull,沉悶的,adjective
dumb,啞的,adjective
dump,傾倒,verb
duration,持續時間,noun
during,在...期間,preposition
dust,灰塵,noun
duty,責任,noun
DVD,DVD,noun
dwarf,矮人,noun
dwell,居住,verb
dye,染料,noun
dying,垂死的,adjective
dynamic,動態的,adjective
dynasty,王朝,noun
each,每個,determiner
eager,渴望的,adjective
ear,耳朵,noun
early,早的,adjective
earn,賺取,verb
earnest,認真的,adjective
earth,地球,noun
earthquake,地震,noun
ease,緩解,verb
easily,容易地,adverb
east,東方,noun
eastern,東方的,adjective
easy,容易的,adjective
eat,吃,verb
echo,回聲,noun
ecological,生態的,adjective
ecology,生態學,noun
economic,經濟的,adjective
economical,經濟的,adjective
economics,經濟學,noun
economist,經濟學家,noun
economy,經濟,noun
edge,邊緣,noun
edit,編輯,verb
edition,版本,noun
editor,編輯,noun
editorial,社論,noun
educate,教育,verb
education,教育,noun
educational,教育的,adjective
educator,教育家,noun
effect,影響,noun
effective,有效的,adjective
effectively,有效地,adverb
efficiency,效率,noun
efficient,高效的,adjective
effort,努力,noun
egg,雞蛋,noun
ego,自我,noun
eight,八,number
eighteen,十八,number
eighth,第八,number
eighty,八十,number
either,要么,conjunction
elaborate,詳盡的,adjective
elbow,肘部,noun
elder,年長的,adjective
elderly,年長的,adjective
elect,選舉,verb
election,選舉,noun
electric,電的,adjective
electrical,電的,adjective
electricity,電力,noun
electronic,電子的,adjective
electronics,電子學,noun
elegant,優雅的,adjective
element,元素,noun
elementary,基本的,adjective
elephant,大象,noun
elevate,提升,verb
elevation,海拔,noun
elevator,電梯,noun
eleven,十一,number
eliminate,消除,verb
elite,精英,noun
else,其他,adverb
elsewhere,別處,adverb
email,電子郵件,noun
embarrass,使尷尬,verb
embassy,大使館,noun
embrace,擁抱,verb
emerge,出現,verb
emergency,緊急情況,noun
emission,排放,noun
emotion,情感,noun
emotional,情緒的,adjective
emphasis,強調,noun
emphasize,強調,verb
empire,帝國,noun
employ,雇用,verb
employee,員工,noun
employer,雇主,noun
employment,就業,noun
empty,空的,adjective
enable,使能夠,verb
enclose,圍住,verb
encounter,遭遇,verb
encourage,鼓勵,verb
encouragement,鼓勵,noun
end,結束,verb
endeavor,努力,noun
ending,結局,noun
endless,無止境的,adjective
endorse,支持,verb
endure,忍受,verb
enemy,敵人,noun
energy,能量,noun
enforce,實施,verb
enforcement,執行,noun
engage,參與,verb
engagement,訂婚,noun
engine,發動機,noun
engineer,工程師,noun
engineering,工程學,noun
enhance,增強,verb
enhancement,增強,noun
enjoy,享受,verb
enlarge,放大,verb
enormous,巨大的,adjective
enough,足夠的,determiner
enquiry,詢問,noun
enrich,豐富,verb
enroll,註冊,verb
ensure,確保,verb
enter,進入,verb
enterprise,企業,noun
entertain,娛樂,verb
entertainment,娛樂,noun
enthusiasm,熱情,noun
enthusiastic,熱情的,adjective
entire,整個的,adjective
entirely,完全地,adverb
entitle,賦予權利,verb
entity,實體,noun
entrance,入口,noun
entrepreneur,企業家,noun
entry,入口,noun
envelope,信封,noun
environment,環境,noun
environmental,環境的,adjective
envisage,設想,verb
envy,嫉妒,noun
enzyme,酶,noun
epidemic,流行病,noun
episode,插曲,noun
equal,平等的,adjective
equality,平等,noun
equally,同樣地,adverb
equation,方程式,noun
equip,裝備,verb
equipment,設備,noun
equivalent,等價的,adjective
era,時代,noun
erode,侵蝕,verb
erosion,侵蝕,noun
error,錯誤,noun
escape,逃脫,verb
especially,特別是,adverb
essay,論文,noun
essence,本質,noun
essential,必要的,adjective
establish,建立,verb
establishment,機構,noun
estate,房地產,noun
estimate,估計,verb
ethical,道德的,adjective
ethics,道德,noun
ethnic,民族的,adjective
euro,歐元,noun
evaluate,評估,verb
evaluation,評估,noun
even,甚至,adverb
evening,晚上,noun
event,事件,noun
eventually,最終,adverb
ever,曾經,adverb
every,每一個,determiner
everybody,每個人,pronoun
everyday,日常的,adjective
everyone,每個人,pronoun
everything,一切,pronoun
everywhere,到處,adverb
evidence,證據,noun
evident,明顯的,adjective
evil,邪惡的,adjective
evolution,進化,noun
evolve,進化,verb
exact,精確的,adjective
exactly,精確地,adverb
exam,考試,noun
examination,檢查,noun
examine,檢查,verb
example,例子,noun
exceed,超過,verb
excellent,優秀的,adjective
except,除了,preposition
exception,例外,noun
exceptional,特殊的,adjective
exchange,交換,verb
excite,興奮,verb
excited,興奮的,adjective
excitement,興奮,noun
exciting,令人興奮的,adjective
exclude,排除,verb
exclusive,專屬的,adjective
excuse,藉口,noun
execute,執行,verb
execution,執行,noun
executive,行政的,adjective
exercise,鍛煉,noun
exhaust,排氣,noun
exhibit,展覽,verb
exhibition,展覽,noun
exist,存在,verb
existence,存在,noun
exit,出口,noun
exotic,異國的,adjective
expand,擴張,verb
expansion,擴張,noun
expect,期望,verb
expectation,期望,noun
expedition,遠征,noun
expense,費用,noun
expensive,昂貴的,adjective
experience,經驗,noun
experiment,實驗,noun
experimental,實驗性的,adjective
expert,專家,noun
expertise,專業知識,noun
explain,解釋,verb
explanation,解釋,noun
explicit,明確的,adjective
explode,爆炸,verb
exploit,利用,verb
exploration,探索,noun
explore,探索,verb
explosion,爆炸,noun
export,出口,verb
expose,暴露,verb
exposure,暴露,noun
express,表達,verb
expression,表達,noun
extend,延伸,verb
extension,延伸部分,noun
extensive,廣泛的,adjective
extent,程度,noun
exterior,外部的,adjective
external,外部的,adjective
extinct,絕種的,adjective
extinction,滅絕,noun
extra,額外的,adjective
extract,提取,verb
extraordinary,非凡的,adjective
extreme,極端的,adjective
extremely,極其,adverb
eye,眼睛,noun
eyebrow,眉毛,noun
fabric,布料,noun
face,臉,noun
facilitate,促進,verb
facility,設施,noun
fact,事實,noun
factor,因素,noun
factory,工廠,noun
faculty,院系,noun
fade,褪色,verb
fail,失敗,verb
failure,失敗,noun
fair,公平的,adjective
fairly,相當地,adverb
fairy,仙女,noun
faith,信仰,noun
faithful,忠實的,adjective
fall,秋天,noun
false,錯誤的,adjective
fame,名聲,noun
familiar,熟悉的,adjective
family,家庭,noun
famous,著名的,adjective
fan,風扇,noun
fancy,花哨的,adjective
fantastic,極好的,adjective
fantasy,幻想,noun
far,遠的,adjective
fare,車費,noun
farm,農場,noun
farmer,農民,noun
farming,農業,noun
fascinating,迷人的,adjective
fashion,時尚,noun
fashionable,時髦的,adjective
fast,快的,adjective
fasten,繫緊,verb
fat,肥的,adjective
fatal,致命的,adjective
fate,命運,noun
father,父親,noun
fatigue,疲勞,noun
fault,過錯,noun
favor,恩惠,noun
favorable,有利的,adjective
favorite,最喜歡的,adjective
fear,恐懼,noun
feasible,可行的,adjective
feast,盛宴,noun
feature,特徵,noun
February,二月,noun
federal,聯邦的,adjective
fee,費用,noun
feed,喂養,verb
feedback,反饋,noun
feel,感覺,verb
feeling,感覺,noun
fellow,同伴,noun
female,女性的,adjective
fence,柵欄,noun
ferry,渡輪,noun
festival,節日,noun
fetch,取來,verb
fever,發燒,noun
few,少數,determiner
fiber,纖維,noun
fiction,小說,noun
field,領域,noun
fierce,兇猛的,adjective
fifteen,十五,number
fifth,第五,number
fifty,五十,number
fight,打架,verb
figure,圖形,noun
file,文件,noun
fill,填充,verb
film,電影,noun
filter,過濾器,noun
final,最終的,adjective
finally,最後,adverb
finance,財務,noun
financial,財政的,adjective
find,找到,verb
finding,發現,noun
fine,好的,adjective
finger,手指,noun
finish,結束,verb
fire,火,noun
fireplace,壁爐,noun
firm,公司,noun
firmly,堅固地,adverb
first,第一,determiner
fish,魚,noun
fisherman,漁夫,noun
fishing,釣魚,noun
fist,拳頭,noun
fit,合身的,adjective
fitness,健康,noun
five,五,number
fix,修理,verb
fixed,固定的,adjective
flag,旗幟,noun
flame,火焰,noun
flash,閃光,noun
flat,平的,adjective
flavor,味道,noun
flee,逃跑,verb
fleet,艦隊,noun
flesh,肉,noun
flexible,靈活的,adjective
flight,航班,noun
float,漂浮,verb
flood,洪水,noun
floor,地板,noun
flour,麵粉,noun
flow,流動,verb
flower,花,noun
fluid,流體,noun
flush,臉紅,verb
fly,飛,verb
foam,泡沫,noun
focus,焦點,noun
fog,霧,noun
fold,折疊,verb
folk,民間的,adjective
follow,跟隨,verb
following,下面的,adjective
fond,喜愛的,adjective
food,食物,noun
fool,傻瓜,noun
foot,腳,noun
football,足球,noun
footstep,腳步聲,noun
for,為了,preposition
forbid,禁止,verb
force,力量,noun
forecast,預測,noun
forehead,前額,noun
foreign,外國的,adjective
foreigner,外國人,noun
forest,森林,noun
forever,永遠,adverb
forget,忘記,verb
forgive,原諒,verb
fork,叉子,noun
form,形式,noun
formal,正式的,adjective
formation,形成,noun
former,前者,adjective
formula,公式,noun
forth,向前,adverb
fortnight,兩週,noun
fortunate,幸運的,adjective
fortune,財富,noun
forty,四十,number
forum,論壇,noun
forward,向前,adverb
fossil,化石,noun
foster,培養,verb
found,發現,verb
foundation,基礎,noun
founder,創始人,noun
fountain,噴泉,noun
four,四,number
fourteen,十四,number
fourth,第四,number
fox,狐狸,noun
fraction,分數,noun
fragile,脆弱的,adjective
fragment,碎片,noun
frame,框架,noun
framework,框架,noun
frankly,坦率地,adverb
free,自由的,adjective
freedom,自由,noun
freely,自由地,adverb
freeze,凍結,verb
freight,貨運,noun
frequency,頻率,noun
frequent,頻繁的,adjective
frequently,頻繁地,adverb
fresh,新鮮的,adjective
friction,摩擦,noun
Friday,星期五,noun
fridge,冰箱,noun
friend,朋友,noun
friendly,友好的,adjective
friendship,友誼,noun
frighten,嚇唬,verb
frog,青蛙,noun
from,從,preposition
front,前面,noun
frontier,邊界,noun
frost,霜,noun
frozen,凍結的,adjective
fruit,水果,noun
frustration,挫折,noun
fry,油炸,verb
fuel,燃料,noun
fulfill,履行,verb
full,滿的,adjective
fully,完全地,adverb
fun,樂趣,noun
function,功能,noun
functional,功能性的,adjective
fund,基金,noun
fundamental,基本的,adjective
funeral,葬禮,noun
funny,有趣的,adjective
fur,毛皮,noun
furniture,傢俱,noun
further,更遠的,adjective
furthermore,此外,adverb
future,未來,noun
gain,獲得,verb
galaxy,星系,noun
gallery,畫廊,noun
game,遊戲,noun
gang,幫派,noun
gap,差距,noun
garage,車庫,noun
garbage,垃圾,noun
garden,花園,noun
garlic,大蒜,noun
garment,服裝,noun
gas,氣體,noun
gate,大門,noun
gather,聚集,verb
gathering,聚會,noun
gay,同性戀的,adjective
gaze,凝視,verb
gear,齒輪,noun
gender,性別,noun
gene,基因,noun
general,普通的,adjective
generally,一般地,adverb
generate,產生,verb
generation,一代,noun
generator,發電機,noun
generous,慷慨的,adjective
genetic,基因的,adjective
genius,天才,noun
gentle,溫和的,adjective
gentleman,紳士,noun
genuine,真實的,adjective
geography,地理,noun
geology,地質學,noun
geometry,幾何學,noun
germ,細菌,noun
gesture,手勢,noun
get,獲得,verb
ghost,鬼,noun
giant,巨大的,adjective
gift,禮物,noun
gifted,有天賦的,adjective
girl,女孩,noun
give,給予,verb
glacier,冰川,noun
glad,高興的,adjective
glance,一瞥,verb
glass,玻璃,noun
glimpse,一瞥,noun
global,全球的,adjective
globe,地球儀,noun
glory,榮耀,noun
glove,手套,noun
glow,發光,verb
glue,膠水,noun
go,走,verb
goal,目標,noun
goat,山羊,noun
god,神,noun
gold,金,noun
golden,金色的,adjective
golf,高爾夫球,noun
good,好的,adjective
goodbye,再見,interjection
goods,商品,noun
goose,鵝,noun
govern,統治,verb
government,政府,noun
governor,州長,noun
grab,抓取,verb
grace,優雅,noun
grade,等級,noun
gradual,逐漸的,adjective
gradually,逐漸地,adverb
graduate,畢業,verb
grain,穀物,noun
grammar,語法,noun
grand,宏偉的,adjective
grandchild,孫子,noun
grandfather,祖父,noun
grandmother,祖母,noun
grandparent,祖父母,noun
grant,授予,verb
grape,葡萄,noun
graph,圖表,noun
grasp,抓住,verb
grass,草,noun
grateful,感謝的,adjective
grave,墳墓,noun
gravity,重力,noun
gray,灰色的,adjective
grease,油脂,noun
great,偉大的,adjective
greatly,非常地,adverb
green,綠色的,adjective
greenhouse,溫室,noun
greet,問候,verb
greeting,問候,noun
grey,灰色的,adjective
grief,悲傷,noun
grill,烤架,noun
grim,嚴厲的,adjective
grind,磨,verb
grip,抓住,verb
grocery,雜貨,noun
gross,總的,adjective
ground,地面,noun
group,群體,noun
grow,成長,verb
growth,成長,noun
guarantee,保證,verb
guard,警衛,noun
guess,猜測,verb
guest,客人,noun
guidance,指導,noun
guide,嚮導,noun
guilty,有罪的,adjective
guitar,吉他,noun
gulf,海灣,noun
gum,口香糖,noun
gun,槍,noun
gut,腸子,noun
guy,傢伙,noun
gym,體育館,noun
gymnasium,體育館,noun
habit,習慣,noun
habitat,棲息地,noun
hair,頭髮,noun
hairdresser,理髮師,noun
half,一半,noun
hall,大廳,noun
hammer,錘子,noun
hand,手,noun
handful,一把,noun
handicap,障礙,noun
handle,處理,verb
handsome,英俊的,adjective
handwriting,書法,noun
hang,掛,verb
happen,發生,verb
happiness,幸福,noun
happy,快樂的,adjective
harassment,騷擾,noun
harbor,港口,noun
hard,硬的,adjective
hardly,幾乎不,adverb
hardware,硬件,noun
harm,傷害,noun
harmony,和諧,noun
harsh,刺耳的,adjective
harvest,收穫,noun
hat,帽子,noun
hate,恨,verb
hatred,仇恨,noun
haunt,出沒,verb
have,有,verb
hay,乾草,noun
hazard,危險,noun
head,頭,noun
headache,頭痛,noun
heading,標題,noun
headline,頭條,noun
headquarters,總部,noun
heal,治愈,verb
health,健康,noun
healthcare,醫療保健,noun
healthy,健康的,adjective
hear,聽見,verb
hearing,聽力,noun
heart,心臟,noun
heat,熱,noun
heating,加熱,noun
heaven,天堂,noun
heavily,沉重地,adverb
heavy,重的,adjective
heel,腳跟,noun
height,高度,noun
heir,繼承人,noun
helicopter,直升機,noun
hell,地獄,noun
hello,你好,interjection
helmet,頭盔,noun
help,幫助,verb
helpful,有幫助的,adjective
helpless,無助的,adjective
hen,母雞,noun
hence,因此,adverb
her,她的,possessive pronoun
herb,草藥,noun
herd,牧群,noun
here,這裡,adverb
heritage,遺產,noun
hero,英雄,noun
heroic,英勇的,adjective
heroin,海洛因,noun
herself,她自己,pronoun
hesitate,猶豫,verb
hide,隱藏,verb
high,高的,adjective
highly,高度地,adverb
highway,高速公路,noun
hijack,劫持,verb
hike,徒步旅行,noun
hill,山丘,noun
him,他(受格),pronoun
himself,他自己,pronoun
hint,提示,noun
hip,臀部,noun
hire,雇用,verb
his,他的,possessive pronoun
historian,歷史學家,noun
historic,歷史性的,adjective
historical,歷史的,adjective
history,歷史,noun
hit,打擊,verb
hobby,嗜好,noun
hold,握住,verb
holder,持有者,noun
hole,洞,noun
holiday,假日,noun
hollow,空心的,adjective
holy,神聖的,adjective
home,家,noun
homeless,無家可歸的,adjective
homework,家庭作業,noun
honest,誠實的,adjective
honey,蜂蜜,noun
honor,榮譽,noun
hook,鉤子,noun
hope,希望,verb
hopeful,有希望的,adjective
hopeless,絕望的,adjective
horizon,地平線,noun
horizontal,水平的,adjective
horn,號角,noun
horror,恐怖,noun
horse,馬,noun
hospital,醫院,noun
host,主持人,noun
hostile,敵對的,adjective
hot,熱的,adjective
hotel,旅館,noun
hour,小時,noun
house,房子,noun
household,家庭,noun
housewife,家庭主婦,noun
how,如何,adverb
however,然而,conjunction
huge,巨大的,adjective
human,人類的,adjective
humble,謙遜的,adjective
humor,幽默,noun
hundred,一百,number
hunger,飢餓,noun
hungry,飢餓的,adjective
hunt,打獵,verb
hunter,獵人,noun
hurricane,颶風,noun
hurry,匆忙,verb
hurt,傷害,verb
husband,丈夫,noun
hut,小屋,noun
hydrogen,氫,noun
hypothesis,假設,noun
ice,冰,noun
idea,想法,noun
ideal,理想的,adjective
identical,相同的,adjective
identification,身份證明,noun
identify,識別,verb
identity,身份,noun
ideology,意識形態,noun
idle,閒置的,adjective
if,如果,conjunction
ignore,忽視,verb
ill,生病的,adjective
illegal,非法的,adjective
illness,疾病,noun
illuminate,照亮,verb
illusion,錯覺,noun
illustration,插圖,noun
image,圖像,noun
imagination,想像力,noun
imagine,想像,verb
imitate,模仿,verb
immediate,立即的,adjective
immediately,立即地,adverb
immigrant,移民,noun
immigration,移民,noun
immune,免疫的,adjective
impact,影響,noun
impatient,不耐煩的,adjective
implement,實施,verb
implication,含義,noun
implicit,含蓄的,adjective
imply,暗示,verb
import,進口,verb
importance,重要性,noun
important,重要的,adjective
impose,強加,verb
impossible,不可能的,adjective
impress,給...深刻印象,verb
impression,印象,noun
impressive,令人印象深刻的,adjective
improve,改進,verb
improvement,改進,noun
impulse,衝動,noun
in,在...之內,preposition
inability,無能,noun
incentive,激勵,noun
inch,英寸,noun
incident,事件,noun
include,包括,verb
inclusion,包含,noun
income,收入,noun
incorporate,合併,verb
increase,增加,verb
incredible,難以置信的,adjective
indeed,的確,adverb
independence,獨立,noun
independent,獨立的,adjective
index,索引,noun
indicate,指示,verb
indication,指示,noun
indicator,指標,noun
indigenous,本土的,adjective
indirect,間接的,adjective
individual,個人,noun
indoor,室內的,adjective
induce,誘導,verb
industrial,工業的,adjective
industry,工業,noun
ineffective,無效的,adjective
inequality,不平等,noun
inevitable,不可避免的,adjective
infant,嬰兒,noun
infection,感染,noun
inference,推論,noun
inferior,較差的,adjective
infinite,無限的,adjective
inflation,通貨膨脹,noun
influence,影響,noun
inform,通知,verb
informal,非正式的,adjective
information,信息,noun
infrastructure,基礎設施,noun
ingredient,成分,noun
inhabitant,居民,noun
inherit,繼承,verb
initial,最初的,adjective
initially,最初地,adverb
initiate,開始,verb
initiative,倡議,noun
inject,注射,verb
injure,傷害,verb
injury,傷害,noun
ink,墨水,noun
inn,小旅館,noun
innocent,無辜的,adjective
innovation,創新,noun
input,輸入,noun
inquiry,詢問,noun
insect,昆蟲,noun
insert,插入,verb
inside,裡面,preposition
insight,洞察力,noun
insist,堅持,verb
inspect,檢查,verb
inspiration,靈感,noun
inspire,激勵,verb
install,安裝,verb
instance,實例,noun
instant,即刻的,adjective
instead,相反,adverb
instinct,本能,noun
institute,機構,noun
institution,機構,noun
instruct,指導,verb
instruction,指示,noun
instructor,講師,noun
instrument,儀器,noun
insurance,保險,noun
intact,完整的,adjective
intake,攝入量,noun
integral,整體的,adjective
integrate,整合,verb
integration,整合,noun
integrity,誠信,noun
intellectual,智力的,adjective
intelligence,智力,noun
intelligent,聰明的,adjective
intend,打算,verb
intense,強烈的,adjective
intensity,強度,noun
intensive,密集的,adjective
intent,意圖,noun
intention,意圖,noun
interact,互動,verb
interaction,互動,noun
interest,興趣,noun
interested,感興趣的,adjective
interesting,有趣的,adjective
interface,界面,noun
interfere,干涉,verb
interim,臨時的,adjective
interior,內部的,adjective
intermediate,中級的,adjective
internal,內部的,adjective
international,國際的,adjective
internet,互聯網,noun
interpret,解釋,verb
interpretation,解釋,noun
interpreter,口譯員,noun
interrupt,打斷,verb
interval,間隔,noun
intervene,干預,verb
intervention,干預,noun
interview,面試,noun
intimate,親密的,adjective
into,進入,preposition
introduce,介紹,verb
introduction,介紹,noun
invade,入侵,verb
invasion,入侵,noun
invent,發明,verb
invention,發明,noun
inventor,發明家,noun
inventory,庫存,noun
invest,投資,verb
investigate,調查,verb
investigation,調查,noun
investment,投資,noun
investor,投資者,noun
invisible,看不見的,adjective
invitation,邀請,noun
invite,邀請,verb
involve,涉及,verb
iron,鐵,noun
irony,諷刺,noun
irregular,不規則的,adjective
irrigate,灌溉,verb
irritate,刺激,verb
island,島嶼,noun
isolate,隔離,verb
isolation,隔離,noun
issue,問題,noun
item,項目,noun
its,它的,possessive pronoun
itself,它自己,pronoun
jacket,夾克,noun
jail,監獄,noun
jam,果醬,noun
jar,罐子,noun
jaw,下巴,noun
jazz,爵士樂,noun
jealous,嫉妒的,adjective
jeans,牛仔褲,noun
jet,噴射機,noun
jewel,珠寶,noun
jewelry,珠寶,noun
job,工作,noun
jog,慢跑,verb
join,加入,verb
joint,關節,noun
joke,笑話,noun
journal,日誌,noun
journalist,記者,noun
journey,旅程,noun
joy,喜悅,noun
judge,法官,noun
judgment,判斷,noun
juice,果汁,noun
jump,跳躍,verb
junction,交匯處,noun
junior,初級的,adjective
jury,陪審團,noun
just,只是,adverb
justice,正義,noun
justify,證明...正當,verb
keen,熱心的,adjective
keep,保持,verb
keeper,看守人,noun
kettle,水壺,noun
key,鑰匙,noun
keyboard,鍵盤,noun
kick,踢,verb
kid,小孩,noun
kill,殺死,verb
killer,殺手,noun
kilogram,公斤,noun
kilometer,公里,noun
kind,種類,noun
kindergarten,幼兒園,noun
kindness,善良,noun
king,國王,noun
kingdom,王國,noun
kiss,親吻,verb
kit,工具包,noun
kitchen,廚房,noun
knee,膝蓋,noun
knife,刀,noun
knight,騎士,noun
knit,編織,verb
knock,敲,verb
knot,結,noun
know,知道,verb
knowledge,知識,noun
lab,實驗室,noun
label,標籤,noun
labor,勞動,noun
laboratory,實驗室,noun
lack,缺乏,verb
ladder,梯子,noun
lady,女士,noun
lake,湖,noun
lamb,羔羊,noun
lamp,燈,noun
land,土地,noun
landing,降落,noun
landlord,房東,noun
landscape,風景,noun
lane,車道,noun
language,語言,noun
lap,大腿,noun
laptop,筆記本電腦,noun
large,大的,adjective
largely,主要地,adverb
laser,激光,noun
last,最後的,adjective
late,晚的,adjective
lately,最近,adverb
later,稍後,adverb
latest,最新的,adjective
latter,後者,noun
laugh,笑,verb
laughter,笑聲,noun
launch,發射,verb
laundry,洗衣,noun
law,法律,noun
lawn,草坪,noun
lawyer,律師,noun
lay,放置,verb
layer,層,noun
lazy,懶惰的,adjective
lead,領導,verb
leader,領導者,noun
leadership,領導力,noun
leading,領先的,adjective
leaf,葉子,noun
league,聯盟,noun
leak,泄漏,verb
lean,傾斜,verb
leap,跳躍,verb
learn,學習,verb
learning,學習,noun
lease,租賃,verb
least,最少,adjective
leather,皮革,noun
leave,離開,verb
lecture,講座,noun
left,左邊的,adjective
leg,腿,noun
legacy,遺產,noun
legal,法律的,adjective
legend,傳說,noun
legislation,立法,noun
legitimate,合法的,adjective
leisure,休閒,noun
lemon,檸檬,noun
lend,借出,verb
length,長度,noun
lens,鏡片,noun
less,較少的,adjective
lesson,課,noun
let,讓,verb
letter,信,noun
level,水平,noun
liability,責任,noun
liable,有責任的,adjective
liberal,自由的,adjective
liberty,自由,noun
library,圖書館,noun
license,執照,noun
lid,蓋子,noun
lie,謊言,noun
life,生活,noun
lifestyle,生活方式,noun
lifetime,一生,noun
lift,提升,verb
light,光,noun
lightning,閃電,noun
like,喜歡,verb
likely,可能的,adjective
likewise,同樣地,adverb
limb,肢體,noun
limit,限制,noun
limitation,限制,noun
limited,有限的,adjective
line,線,noun
link,連結,noun
lion,獅子,noun
lip,嘴唇,noun
liquid,液體,noun
list,清單,noun
listen,聽,verb
literacy,識字能力,noun
literal,字面的,adjective
literary,文學的,adjective
literature,文學,noun
little,小的,adjective
live,活著,verb
lively,活潑的,adjective
liver,肝臟,noun
living,活著,adjective
load,裝載,verb
loan,貸款,noun
lobby,大廳,noun
local,當地的,adjective
locate,定位,verb
location,位置,noun
lock,鎖,noun
lodge,小屋,noun
log,原木,noun
logic,邏輯,noun
logical,合邏輯的,adjective
lonely,孤獨的,adjective
long,長的,adjective
look,看,verb
loop,循環,noun
loose,鬆的,adjective
lord,主,noun
lose,失去,verb
loss,損失,noun
lost,迷失的,adjective
lot,很多,noun
loud,大聲的,adjective
love,愛,verb
lovely,可愛的,adjective
lover,愛人,noun
low,低的,adjective
lower,降低,verb
loyal,忠誠的,adjective
loyalty,忠誠,noun
luck,運氣,noun
lucky,幸運的,adjective
luggage,行李,noun
lumber,木材,noun
lunch,午餐,noun
lung,肺,noun
luxury,奢侈,noun
machine,機器,noun
mad,生氣的,adjective
magazine,雜誌,noun
magic,魔法,noun
magnetic,磁性的,adjective
magnificent,壯麗的,adjective
mail,郵件,noun
main,主要的,adjective
mainly,主要地,adverb
maintain,維持,verb
maintenance,維護,noun
major,主要的,adjective
majority,多數,noun
make,製作,verb
maker,製造者,noun
makeup,化妝品,noun
male,男性的,adjective
mall,購物中心,noun
man,男人,noun
manage,管理,verb
management,管理,noun
manager,經理,noun
manner,方式,noun
mansion,豪宅,noun
manual,手冊,noun
manufacture,製造,verb
manufacturer,製造商,noun
manufacturing,製造業,noun
many,許多,determiner
map,地圖,noun
marathon,馬拉松,noun
marble,大理石,noun
march,行軍,verb
margin,邊緣,noun
marine,海洋的,adjective
mark,標記,noun
marker,標記,noun
market,市場,noun
marketing,市場營銷,noun
marriage,婚姻,noun
married,已婚的,adjective
marry,結婚,verb
martial,武術的,adjective
mask,面具,noun
mass,大量,noun
massive,巨大的,adjective
master,主人,noun
match,匹配,verb
mate,伙伴,noun
material,材料,noun
mathematics,數學,noun
matrix,矩陣,noun
matter,事情,noun
mature,成熟的,adjective
maximum,最大的,adjective
may,可能,verb
maybe,也許,adverb
mayor,市長,noun
me,我(受格),pronoun
meal,餐,noun
mean,意思是,verb
meaning,意義,noun
means,方法,noun
meantime,同時,noun
meanwhile,同時,adverb
measure,測量,verb
measurement,測量,noun
meat,肉,noun
mechanic,機械師,noun
mechanical,機械的,adjective
mechanism,機制,noun
medal,獎牌,noun
media,媒體,noun
medical,醫療的,adjective
medication,藥物,noun
medicine,醫學,noun
medium,中等的,adjective
meet,遇見,verb
meeting,會議,noun
melt,融化,verb
member,成員,noun
membership,會員資格,noun
memory,記憶,noun
mental,精神上的,adjective
mention,提及,verb
menu,菜單,noun
merchant,商人,noun
mercy,憐憫,noun
mere,僅僅的,adjective
merely,僅僅,adverb
merge,合併,verb
merger,合併,noun
merit,優點,noun
mess,混亂,noun
message,訊息,noun
metal,金屬,noun
metaphor,隱喻,noun
method,方法,noun
methodology,方法論,noun
meter,米,noun
metropolitan,大都市的,adjective
microphone,麥克風,noun
microscope,顯微鏡,noun
microwave,微波爐,noun
mid,中間的,adjective
middle,中間,noun
midnight,午夜,noun
midst,中間,noun
might,可能,verb
migrate,遷移,verb
migration,遷移,noun
mild,溫和的,adjective
mile,英里,noun
military,軍事的,adjective
milk,牛奶,noun
mill,磨坊,noun
million,百萬,number
mind,頭腦,noun
mine,礦山,noun
mineral,礦物,noun
minimal,最小的,adjective
minimize,最小化,verb
minimum,最小,noun
minister,部長,noun
ministry,部,noun
minor,較小的,adjective
minority,少數,noun
minus,減,preposition
minute,分鐘,noun
miracle,奇蹟,noun
mirror,鏡子,noun
misery,痛苦,noun
miss,想念,verb
missile,導彈,noun
missing,失踪的,adjective
mission,任務,noun
mistake,錯誤,noun
mix,混合,verb
mixture,混合物,noun
mobile,移動的,adjective
mode,模式,noun
model,模型,noun
moderate,適度的,adjective
modern,現代的,adjective
modest,謙虛的,adjective
modify,修改,verb
module,模塊,noun
moist,潮濕的,adjective
moisture,水分,noun
mom,媽媽,noun
moment,片刻,noun
momentum,動力,noun
mommy,媽媽,noun
monarch,君主,noun
Monday,星期一,noun
monetary,金錢的,adjective
money,錢,noun
monitor,監視器,noun
monkey,猴子,noun
monopoly,壟斷,noun
monster,怪物,noun
month,月份,noun
monthly,每月的,adjective
monument,紀念碑,noun
mood,心情,noun
moon,月亮,noun
moral,道德的,adjective
morality,道德,noun
moreover,此外,adverb
morning,早晨,noun
mortality,死亡率,noun
mortgage,抵押貸款,noun
mosque,清真寺,noun
most,最多的,determiner
mostly,主要地,adverb
mother,母親,noun
motion,運動,noun
motivate,激勵,verb
motivation,動機,noun
motive,動機,noun
motor,發動機,noun
motorcycle,摩托車,noun
mount,登上,verb
mountain,山,noun
mourn,哀悼,verb
mouse,老鼠,noun
mouth,嘴,noun
move,移動,verb
movement,運動,noun
movie,電影,noun
much,很多,determiner
mud,泥,noun
multiple,多個的,adjective
multiply,乘,verb
murder,謀殺,noun
muscle,肌肉,noun
museum,博物館,noun
mushroom,蘑菇,noun
music,音樂,noun
musical,音樂的,adjective
musician,音樂家,noun
must,必須,verb
mutual,相互的,adjective
my,我的,possessive pronoun
myself,我自己,pronoun
mysterious,神秘的,adjective
mystery,神秘,noun
myth,神話,noun
nail,釘子,noun
naked,裸體的,adjective
name,名字,noun
namely,即,adverb
narrative,敘述,noun
narrow,窄的,adjective
nasty,討厭的,adjective
nation,國家,noun
national,國家的,adjective
nationality,國籍,noun
native,本地的,adjective
natural,自然的,adjective
naturally,自然地,adverb
nature,自然,noun
naval,海軍的,adjective
navigate,導航,verb
navigation,導航,noun
navy,海軍,noun
near,靠近,preposition
nearby,附近的,adjective
nearly,幾乎,adverb
neat,整潔的,adjective
necessarily,必然地,adverb
necessary,必要的,adjective
necessity,必要性,noun
neck,脖子,noun
need,需要,verb
needle,針,noun
negative,負面的,adjective
neglect,忽視,verb
negotiate,談判,verb
negotiation,談判,noun
neighbor,鄰居,noun
neighborhood,鄰里,noun
neither,兩者都不,determiner
nephew,侄子,noun
nerve,神經,noun
nervous,緊張的,adjective
nest,巢,noun
net,網,noun
network,網絡,noun
neutral,中立的,adjective
never,從不,adverb
nevertheless,然而,adverb
new,新的,adjective
newly,新近地,adverb
news,新聞,noun
newspaper,報紙,noun
next,下一個,adjective
nice,好的,adjective
night,夜晚,noun
nightmare,噩夢,noun
nine,九,number
nineteen,十九,number
ninety,九十,number
ninth,第九,number
no,不,determiner
noble,高貴的,adjective
nobody,沒人,pronoun
nod,點頭,verb
noise,噪音,noun
noisy,嘈雜的,adjective
nominal,名義上的,adjective
nominate,提名,verb
nomination,提名,noun
nominee,被提名者,noun
none,沒有一個,pronoun
nonetheless,然而,adverb
nonsense,胡說,noun
noon,中午,noun
nor,也不,conjunction
normal,正常的,adjective
normally,通常地,adverb
north,北方,noun
northern,北方的,adjective
nose,鼻子,noun
not,不,adverb
notable,顯著的,adjective
note,注意,verb
notebook,筆記本,noun
nothing,沒什麼,pronoun
notice,注意,verb
notion,概念,noun
notorious,臭名昭著的,adjective
notwithstanding,儘管,preposition
noun,名詞,noun
nourish,滋養,verb
novel,小說,noun
now,現在,adverb
nowhere,無處,adverb
nuclear,核的,adjective
nucleus,核心,noun
nuisance,討厭的人或事,noun
number,數字,noun
numerous,許多的,adjective
nurse,護士,noun
nursery,托兒所,noun
nut,堅果,noun
nutrition,營養,noun
nylon,尼龍,noun
oak,橡樹,noun
obey,服從,verb
object,物體,noun
objection,反對,noun
objective,客觀的,adjective
obligation,義務,noun
observation,觀察,noun
observe,觀察,verb
observer,觀察者,noun
obsession,痴迷,noun
obstacle,障礙,noun
obtain,獲得,verb
obvious,明顯的,adjective
obviously,明顯地,adverb
occasion,場合,noun
occasional,偶爾的,adjective
occasionally,偶爾,adverb
occupation,職業,noun
occupy,佔據,verb
occur,發生,verb
ocean,海洋,noun
odd,奇怪的,adjective
odds,概率,noun
of,的,preposition
off,離開,adverb
offence,罪行,noun
offend,冒犯,verb
offensive,攻擊性的,adjective
offer,提供,verb
offering,提供,noun
office,辦公室,noun
officer,軍官,noun
official,官方的,adjective
officially,正式地,adverb
offset,抵消,verb
offshore,近海的,adjective
often,經常,adverb
oh,哦,interjection
oil,油,noun
okay,好的,adjective
old,老的,adjective
olympic,奧林匹克的,adjective
omit,省略,verb
on,在...上,preposition
once,一次,adverb
one,一,number
ongoing,持續的,adjective
onion,洋蔥,noun
online,在線的,adjective
only,只,adverb
onto,到...上,preposition
open,開放的,adjective
opening,開口,noun
opera,歌劇,noun
operate,操作,verb
operation,操作,noun
operator,操作員,noun
opinion,意見,noun
opponent,對手,noun
opportunity,機會,noun
oppose,反對,verb
opposite,相反的,adjective
opposition,反對,noun
opt,選擇,verb
optical,光學的,adjective
optimal,最佳的,adjective
optimism,樂觀,noun
optimistic,樂觀的,adjective
option,選擇,noun
optional,可選的,adjective
or,或者,conjunction
oral,口頭的,adjective
orange,橙色的,adjective
orbit,軌道,noun
orchestra,管弦樂隊,noun
order,順序,noun
ordinary,普通的,adjective
organic,有機的,adjective
organization,組織,noun
organize,組織,verb
orientation,方向,noun
origin,起源,noun
original,原始的,adjective
originally,最初,adverb
originate,起源,verb
other,其他的,adjective
otherwise,否則,adverb
ought,應該,verb
our,我們的,possessive pronoun
ourselves,我們自己,pronoun
out,出,adverb
outbreak,爆發,noun
outcome,結果,noun
outdoor,戶外的,adjective
outer,外部的,adjective
outlet,出口,noun
outline,概述,noun
output,產出,noun
outside,外部,noun
outstanding,傑出的,adjective
oven,烤箱,noun
over,在...上方,preposition
overall,總體的,adjective
overcome,克服,verb
overlook,忽視,verb
overnight,一夜間的,adjective
overseas,海外的,adjective
oversee,監督,verb
overtake,超越,verb
overthrow,推翻,verb
overtime,加班,noun
owe,欠,verb
own,擁有,verb
owner,所有者,noun
ownership,所有權,noun
oxygen,氧氣,noun
pace,步伐,noun
pack,包裝,verb
package,包裹,noun
pad,墊,noun
page,頁,noun
pain,疼痛,noun
painful,痛苦的,adjective
paint,油漆,noun
painter,畫家,noun
painting,繪畫,noun
pair,一對,noun
palace,宮殿,noun
pale,蒼白的,adjective
palm,手掌,noun
pan,平底鍋,noun
panel,面板,noun
panic,恐慌,noun
pants,褲子,noun
paper,紙,noun
paperwork,文書工作,noun
parade,遊行,noun
paragraph,段落,noun
parallel,平行的,adjective
parameter,參數,noun
parent,父母,noun
parish,教區,noun
park,公園,noun
parking,停車,noun
parliament,議會,noun
part,部分,noun
partial,部分的,adjective
participant,參與者,noun
participate,參與,verb
participation,參與,noun
particle,粒子,noun
particular,特定的,adjective
particularly,特別地,adverb
partly,部分地,adverb
partner,夥伴,noun
partnership,合夥關係,noun
party,派對,noun
pass,通過,verb
passage,通道,noun
passenger,乘客,noun
passion,熱情,noun
passive,被動的,adjective
passport,護照,noun
past,過去,noun
paste,粘貼,verb
pastor,牧師,noun
pat,輕拍,verb
patch,補丁,noun
patent,專利,noun
path,路徑,noun
patience,耐心,noun
patient,病人,noun
patrol,巡邏,noun
patron,贊助人,noun
pattern,模式,noun
pause,暫停,verb
paw,爪子,noun
pay,支付,verb
payment,付款,noun
pea,豌豆,noun
peace,和平,noun
peaceful,和平的,adjective
peak,頂峰,noun
peanut,花生,noun
pear,梨,noun
peasant,農民,noun
peculiar,奇特的,adjective
peer,同輩,noun
pen,鋼筆,noun
penalty,懲罰,noun
pencil,鉛筆,noun
pending,待定的,adjective
penetrate,穿透,verb
pension,退休金,noun
people,人們,noun
pepper,胡椒,noun
per,每,preposition
perceive,感知,verb
percentage,百分比,noun
perception,感知,noun
perfect,完美的,adjective
perfectly,完美地,adverb
perform,表演,verb
performance,表現,noun
performer,表演者,noun
perhaps,也許,adverb
peril,危險,noun
period,時期,noun
